Renova/src/Documents/ОтчетОПродажах/ОтчетОПродажах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОтчетОПродажах</name>
  <registerRecords>AccumulationRegister.ОтчетПоПродажам</registerRecords>
  <attributes>
    <name>СписокВидовПродукции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФирмаПроизводитель</name>
    <type>
      <types>CatalogRef.ФирмыПроизводители</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>ВидПродукции</name>
      <type>
        <types>CatalogRef.ВидыПродукции</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МесяцПродаж</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.МоделиПродукции</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Renova/src/AccumulationRegisters/ОтчетПоПродажам/ОтчетПоПродажам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОтчетПоПродажам</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВидПродукции</name>
    <type>
      <types>CatalogRef.ВидыПродукции</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МодельПродукции</name>
    <type>
      <types>CatalogRef.МоделиПродукции</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Фабрика</name>
    <type>
      <types>CatalogRef.ФабрикиИСмены</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Фирма</name>
    <type>
      <types>CatalogRef.ФирмыПроизводители</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МесяцПродаж</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Renova/src/Documents/ОтчетОПродажах/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		НачалоПериода = НачалоМесяца(ТекущаяУниверсальнаяДата());
		КонецПериода = НачалоПериода;
	КонецЕсли;
КонецПроцедуры

#Если Сервер или ТолстыйКлиентОбычноеПриложение или ВнешнееСоединение Тогда

Процедура ОбработкаПроведения(Отказ, Режим)

    // Получаем соответствие запрещенных комбинаций (ключ -> дата более позднего документа)
    ЗапрещенныеКомбинации = ПолучитьЗапрещенныеКомбинации();

    // Начинаем формирование движений
    Движения.ОтчетПоПродажам.Записывать = Истина;

    КоличествоЗапрещено = 0;
    КоличествоПерезаписано = 0;

    Для Каждого ТекСтрокаТовары Из Товары Цикл

        // Пропускаем строки с незаполненными обязательными реквизитами
        Если Не ЗначениеЗаполнено(ТекСтрокаТовары.Номенклатура) Или
           Не ЗначениеЗаполнено(ТекСтрокаТовары.Количество) Тогда
            Продолжить;
        КонецЕсли;
		
		Если ЗапрещенныеКомбинации.Количество() > 0 Тогда
			// Формируем ключ для проверки (единый формат для обеих сторон)
			Ключ = Строка(ТекСтрокаТовары.Номенклатура) + "|" + Формат(ТекСтрокаТовары.МесяцПродаж, "ДФ=yyyyMMdd");
		КонецЕсли;
		
        // Проверяем, есть ли более поздняя запись в регистре
        Если ЗапрещенныеКомбинации.Получить(Ключ) <> Неопределено Тогда
            Сообщить("Строка по модели " + ТекСтрокаТовары.Номенклатура +
                      " за месяц " + Формат(ТекСтрокаТовары.МесяцПродаж, "ДФ='MMMM yyyy';") +
                      " НЕ БУДЕТ ЗАПИСАНА, так как имеются более поздние данные (документ от " +
                      Формат(ЗапрещенныеКомбинации[Ключ], "Д") + ").");
            КоличествоЗапрещено = КоличествоЗапрещено + 1;
            Продолжить;
        КонецЕсли;

        // Создаём движение
        Движение = Движения.ОтчетПоПродажам.Добавить();
        Движение.Период = Дата;                
        Движение.ВидПродукции = ТекСтрокаТовары.ВидПродукции;
        Движение.МодельПродукции = ТекСтрокаТовары.Номенклатура;
        Движение.Фирма = ФирмаПроизводитель;    
        Движение.Фабрика = Справочники.ФабрикиИСмены.ПустаяСсылка(); // для тестирования
        Движение.МесяцПродаж = ТекСтрокаТовары.МесяцПродаж;
        Движение.Количество = ТекСтрокаТовары.Количество;

        КоличествоПерезаписано = КоличествоПерезаписано + 1;

    КонецЦикла;

    // Выводим итоговые сообщения
    Если КоличествоЗапрещено > 0 Тогда
        Сообщить("Внимание! Было пропущено " + КоличествоЗапрещено + " строк(и) из-за наличия более поздних записей.");
    КонецЕсли;

    Если КоличествоПерезаписано > 0 Тогда
        Сообщить("Записано " + КоличествоПерезаписано + " строк(и). Старые данные (если были) перезаписаны.");
    КонецЕсли;
	
КонецПроцедуры
#КонецЕсли
#КонецОбласти 

#Область СлужебныеПроцедурыИФункции
#Если Сервер или ТолстыйКлиентОбычноеПриложение или ВнешнееСоединение Тогда
Функция ПолучитьЗапрещенныеКомбинации() 
	
  	МассивНоменклатуры = Товары.ВыгрузитьКолонку("Номенклатура");
	МассивМесяцев = Товары.ВыгрузитьКолонку("МесяцПродаж");

    // Запрос к регистру для получения максимальной даты документа по каждой комбинации
    Запрос = Новый Запрос;
    Запрос.Текст = 	"ВЫБРАТЬ
                   |	ОтчетПоПродажам.МодельПродукции КАК МодельПродукции,
                   |	ОтчетПоПродажам.МесяцПродаж КАК МесяцПродаж,
                   |	МАКСИМУМ(ОтчетПоПродажам.Период) КАК Период
				   |ИЗ
                   |	РегистрНакопления.ОтчетПоПродажам КАК ОтчетПоПродажам
                   |ГДЕ
                   |	ОтчетПоПродажам.МодельПродукции В(&Модель)
                   |	И ОтчетПоПродажам.МесяцПродаж В(&Месяц)
                   |
                   |СГРУППИРОВАТЬ ПО
                   |	ОтчетПоПродажам.МодельПродукции,
                   |	ОтчетПоПродажам.МесяцПродаж";

    Запрос.УстановитьПараметр("Модель", МассивНоменклатуры);
    Запрос.УстановитьПараметр("Месяц", МассивМесяцев);

    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();

    Запрет = Новый Соответствие;
    Пока Выборка.Следующий() Цикл
        Если Выборка.Период > Ссылка.Дата Тогда
            Ключ = Строка(Выборка.МодельПродукции) + "|" + Формат(Выборка.МесяцПродаж, "ДФ=yyyyMMdd");
            Запрет.Вставить(Ключ, Выборка.Период);
        КонецЕсли;
    КонецЦикла;

    Возврат Запрет;	
КонецФункции

#КонецЕсли
#КонецОбласти
